README.org
* Hello Mana Card Game (Prolog)

A simple two-player card game with Prolog, where each player draws and plays cards to accumulate mana. The first to reach 20 mana wins.

** Game Rules
- Each player starts with a shuffled deck of 30 cards (mana values 1–5, weighted distribution).
- Both players draw 3 cards for their initial hand.
- On your turn, draw a card, then play the highest value card in your hand.
- The played card’s mana value is added to your mana count; the card then goes to your discard pile.
- Players alternate turns. The first turn for player 1 skips the draw step.
- First player to reach 20 or more mana wins.

** Requirements
  - [[https://www.swi-prolog.org/][SWI-Prolog]]


** How to Run
  1. Run from `swipl` script

   Open a terminal in the game’s directory. change `play.pl` to be executable
   #+begin_src shell
   chmod +x play.pl
   #+end_src

   Then run play.pl
   #+begin_src shell
   ./play.pl
   #+end_src

  2. Or from Prolog's toplevel (REPL)
   Or start prolog
   #+begin_src prolog
   swipl
   #+end_src

   And run
   #+begin_src prolog
   ?- [hello_mana].
   ?- play_game.
   #+end_src
